set_property SRC_FILE_INFO {cfile:/afs/rchland.ibm.com/rel/common/proj/surelock/usr/allison/fire_build_git/omi_host_fire/xdc/timing.xdc rfile:../../xdc/timing.xdc id:1} [current_design]
set_property src_info {type:XDC file:1 line:17 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks {VIRTUAL_txoutclk_out[0]_1}] -min -add_delay 0.200 [get_ports RAW_RESETN]
set_property src_info {type:XDC file:1 line:18 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks {VIRTUAL_txoutclk_out[0]_1}] -max -add_delay 0.400 [get_ports RAW_RESETN]
set_property src_info {type:XDC file:1 line:49 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -from [get_pins {vio/inst/PROBE_OUT_ALL_INST/G_PROBE_OUT[0].PROBE_OUT0_INST/Probe_out_reg[0]/C}] -to [get_ports ICE_RESETN]
set_property src_info {type:XDC file:1 line:51 export:INPUT save:INPUT read:READ} [current_design]
set_false_path -from [get_clocks -of_objects [get_pins {hss0/hss_phy/example_wrapper_inst/DLx_phy_inst/inst/gen_gtwizard_gtye4_top.gtwizard_ultrascale_0_gtwizard_gtye4_inst/gen_gtwizard_gtye4.gen_channel_container[6].gen_enabled_channel.gtye4_channel_wrapper_inst/channel_inst/gtye4_channel_gen.gen_gtye4_channel_inst[0].GTYE4_CHANNEL_PRIM_INST/TXOUTCLK}]] -to [get_clocks -of_objects [get_pins hss0/hss_phy/BUFGCE_DIV_inst/O]]
set_property src_info {type:XDC file:1 line:54 export:INPUT save:INPUT read:READ} [current_design]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins fire_pervasive/clk_wiz/inst/plle4_adv_inst/CLKOUT0]]
set_property src_info {type:XDC file:1 line:55 export:INPUT save:INPUT read:READ} [current_design]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {hss0/hss_phy/example_wrapper_inst/DLx_phy_inst/inst/gen_gtwizard_gtye4_top.gtwizard_ultrascale_0_gtwizard_gtye4_inst/gen_gtwizard_gtye4.gen_channel_container[6].gen_enabled_channel.gtye4_channel_wrapper_inst/channel_inst/gtye4_channel_gen.gen_gtye4_channel_inst[0].GTYE4_CHANNEL_PRIM_INST/TXOUTCLK}]]
set_property src_info {type:XDC file:1 line:59 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks clk_out1_clk_wiz_sysclk] -min -add_delay 0.000 [get_ports RAW_RESETN]
set_property src_info {type:XDC file:1 line:60 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock [get_clocks clk_out1_clk_wiz_sysclk] -max -add_delay 0.000 [get_ports RAW_RESETN]
set_property src_info {type:XDC file:1 line:61 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clk_out1_clk_wiz_sysclk] -min -add_delay 0.000 [get_ports PLL_LOCKED]
set_property src_info {type:XDC file:1 line:62 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock [get_clocks clk_out1_clk_wiz_sysclk] -max -add_delay 0.000 [get_ports PLL_LOCKED]
